Ran Plan for 2 projects:

1. dir: `eu-central-1/production` workspace: `default`
1. dir: `eu-central-1/staging` workspace: `default`
---

### 1. dir: `eu-central-1/production` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecr_repository.flux_airflow will be created
+ resource "aws_ecr_repository" "flux_airflow" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "flux-airflow"
      + region               = "eu-central-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"        = "flux-airflow"
          + "environment" = "production"
          + "team"        = "flux-engineering"
          + "terraform"   = "true"
        }
      + tags_all             = {
          + "Name"        = "flux-airflow"
          + "environment" = "production"
          + "team"        = "flux-engineering"
          + "terraform"   = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eu-central-1/production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://161.97.80.18:4141/lock?id=Federated-Engineers%252Fflux-cloud-infrastructures%252Feu-central-1%252Fproduction%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eu-central-1/production
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `eu-central-1/staging` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eu-central-1/staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://161.97.80.18:4141/lock?id=Federated-Engineers%252Fflux-cloud-infrastructures%252Feu-central-1%252Fstaging%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eu-central-1/staging
  ```

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```